app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sd"], ["email", "jose@ga.co"], ["created_at", "2018-04-21 04:20:03.246628"], ["updated_at", "2018-04-21 04:20:03.246628"]]